# <b>Pandas Notes</b>

* Data frames and Series DataFrames Data frames and Series DataFrames (2D Data Sctructure / rows and columns)

In [131]:
import pandas as pd

In [132]:
# How to open a file
pokemon = pd.read_csv('Pokemon.csv')

In [3]:
pokemon.head(3)

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,1,False

## Attributes and Methods on how our data looks like:
<code>.shape</code> Attribute <br>
<code>.info()</code> Method <br>

In [133]:
pokemon.shape

(800, 13)

In [134]:
pokemon.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 800 entries, 0 to 799
Data columns (total 13 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   #           800 non-null    int64
 1   Name        800 non-null    object
 2   Type 1      800 non-null    object
 3   Type 2      414 non-null    object
 4   Total       800 non-null    int64
 5   HP          800 non-null    int64
 6   Attack      800 non-null    int64
 7   Defense     800 non-null    int64
 8   Sp. Atk     800 non-null    int64
 9   Sp. Def     800 non-null    int64
 10  Speed       800 non-null    int64
 11  Generation  800 non-null    int64
 12  Legendary   800 non-null    bool
dtypes: bool(1), int64(9), object(3)
memory usage: 75.9+ KB

In [12]:
# Data types: 
# Objects are usally "Strings"

* ### Change a settings to see all the columns and rows
<code>pd.set_option('display.max_columns', 83)</code> to see the columns
<code>pd.set_option('display.max_rows', intValue)</code> to see the rows

* ### To know more about the data, it's best to have an Schema of the discription for the collumns. 
##### A schema for the discriptions of the attributes would be a good habit

### .methods() to use to limit what you see<br>

to see the first nth rows of a dataframe. <br>
<code> df.head(n) <code> <code>df.tail(n) <code>

In [135]:
# to see the rows
pokemon.head(2)

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,False

In [136]:
pokemon.tail(2)

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
798,720,HoopaHoopa Unbound,Psychic,Dark,680,80,160,60,170,130,80,6,True
799,721,Volcanion,Fire,Water,600,80,110,120,130,90,70,6,True

## Data frames and Series Data Types

We will be using the Series Data Types the most

In [137]:
# This is a Data Frame. 
# Made of Rows and Columns
pokemon.head(2)

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,False

### Rows
##### rows is a tuple, or a field. It stores a vale to an Attribute

### Columns 
##### columns is the Attrubte of the "Table."

### Note:
#### Table = Entity = Class = Dictionary
#### Column = Attribute = field = Key
#### Row = tuple = information stored = Value

In [42]:
import csv

with open('Pokemon.csv', 'r') as f:
    csv_reader = csv.reader(f)
    # then iterate

In [43]:
pokemon = open('Pokemon.csv') 
#Then iterate

In [94]:
# example of a column with row data 
# Person is the Table, first, last and email are Attributes/fields
# and values are the rows/tuples (can't be changed)
person = {
    "first": ["Corey", "Jane", "John"],
    "last" : ["Schafer", "Doe", "Doe"],
    "email": ["CoreyMSchafer@gmail.com", "JaneDough@gmail.com", "JohnDough@gmail.com"]}

In [95]:
person["email"]

['CoreyMSchafer@gmail.com', 'JaneDough@gmail.com', 'JohnDough@gmail.com']

In [96]:
# to access the rows...
person['email']

['CoreyMSchafer@gmail.com', 'JaneDough@gmail.com', 'JohnDough@gmail.com']

### Dataframes

In [97]:
import pandas as pd
df = pd.DataFrame(person)
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe      JaneDough@gmail.com
2   John      Doe      JohnDough@gmail.com

Index is on the far left. Stats at Zero (0)

In [98]:
# How to access a column?
df['last']

0    Schafer
1        Doe
2        Doe
Name: last, dtype: object

In [99]:
# If we check the collumn , we see its' a Series Object
type(df['last'])

pandas.core.series.Series

### What is a Series?
##### 1D Array (Rows of Data), ROWS OF A SINGLE COLLUMN, Values of a Collumn

<code>.dotNotation</code>

In [100]:
df.email

0    CoreyMSchafer@gmail.com
1        JaneDough@gmail.com
2        JohnDough@gmail.com
Name: email, dtype: object

### How to access multipul columns?

In [105]:
df[["last", "email"]] # a list of columns 
# multipul columns is a DATAFRAME / Filtered Down Dataframe
# Not a series anymore

      last                    email
0  Schafer  CoreyMSchafer@gmail.com
1      Doe      JaneDough@gmail.com
2      Doe      JohnDough@gmail.com

### Print Collumns and Rows

In [107]:
#Prings out the attributes / columns
df.columns

Index(['first', 'last', 'email'], dtype='object')

### How Do we Get ROWS?

<code>.loc[]</code> <code>.iloc[]</code>  
BRACKETS are used because it's an INDEX

#### <code>.iloc[]</code>

In [114]:
# iloc Integer Location
# This is the 1st row
df.iloc[0]
# returns a series of the first ROW of the data
# the index is the Collumn Name

first                      Corey
last                     Schafer
email    CoreyMSchafer@gmail.com
Name: 0, dtype: object

In [118]:
df.iloc[[0,1]]
# first two rows of data

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe      JaneDough@gmail.com

In [122]:
# we want a collumn now
df.iloc[[0,1], 2]
# .iloc([rows], collumns)

0    CoreyMSchafer@gmail.com
1        JaneDough@gmail.com
Name: email, dtype: object

#### <code>.loc[]</code>

In [123]:
#.loc[] uses lables and can be like iloc[]

In [124]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe      JaneDough@gmail.com
2   John      Doe      JohnDough@gmail.com

In [127]:
df.loc[0]

first                      Corey
last                     Schafer
email    CoreyMSchafer@gmail.com
Name: 0, dtype: object

In [128]:
# 1st and 2nd row
df.loc[[0,1]]

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe      JaneDough@gmail.com

In [129]:
# select a collumn with the rows
df.loc[[0,1], 'email']

0    CoreyMSchafer@gmail.com
1        JaneDough@gmail.com
Name: email, dtype: object

In [130]:
# can do a list of strings too
df.loc[[0,1], ['email', 'last']]

                     email     last
0  CoreyMSchafer@gmail.com  Schafer
1      JaneDough@gmail.com      Doe

### Practice:

In [138]:
pokemon.head(3)

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,1,False

In [143]:
# we want Name, Type, Generation:
pokemon[ ['Name', 'Type 1', 'Generation'] ].head(3)

        Name Type 1  Generation
0  Bulbasaur  Grass           1
1    Ivysaur  Grass           1
2   Venusaur  Grass           1

In [144]:
pokemon.shape

(800, 13)

In [146]:
len(pokemon.columns)

13

In [149]:
pokemon['Name'].head(2)

0    Bulbasaur
1      Ivysaur
Name: Name, dtype: object

In [150]:
len(pokemon['Name'])

800

In [175]:
isLegendary=pokemon['Legendary'] == True
len(pokemon[isLegendary])

65

In [176]:
pokemon[isLegendary].tail(3)

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
797,720,HoopaHoopa Confined,Psychic,Ghost,600,80,110,60,150,130,70,6,True
798,720,HoopaHoopa Unbound,Psychic,Dark,680,80,160,60,170,130,80,6,True
799,721,Volcanion,Fire,Water,600,80,110,120,130,90,70,6,True

In [177]:
pokemon.head(3)

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,1,False

In [182]:
pokemon.loc[0, "Generation"]

1

#### We can use Slicing

In [187]:
pokemon.loc[0:3, "Name"] # DO NOT USE BRACKETS WHEN SLICING. ( NOT AN LIST )

0                Bulbasaur
1                  Ivysaur
2                 Venusaur
3    VenusaurMega Venusaur
Name: Name, dtype: object

In [191]:
pokemon.iloc[0, 0:]

#                     1
Name          Bulbasaur
Type 1            Grass
Type 2           Poison
Total               318
HP                   45
Attack               49
Defense              49
Sp. Atk              65
Sp. Def              65
Speed                45
Generation            1
Legendary         False
Name: 0, dtype: object